#include <stdio.h>

void initMatrix(int M, int N, int A[M][N])
{
    for (int i = 0; i < M; i++)
    {
        for (int j = 0; j < N; j++)
        {
            A[i][j] = i * 100 + j;
        }
    }
}

void printMatrix(int M, int N, int A[M][N])
{
    for (int i = 0; i < M; i++)
    {
        for (int j = 0; j < N; j++)
        {
            printf("%d\t", A[i][j]);
        }
        printf("\n");
    }
    printf("\n");
}

int main()
{
    int A[8][8];
    int B[8][8] = {0};
    initMatrix(8, 8, A);
    int r0, r1, r2, r3, r4, r5, r6, r7, r8, r9, r10;
    for (r0 = 0; r0 < 8; r0 += 8)
    {
        for (r1 = 0; r1 < 8; r1 += 8)
        {
            for (r2 = r0; r2 < r0 + 4; r2++)
            {
                //西北
                r3 = A[r2][r1];
                r4 = A[r2][r1 + 1];
                r5 = A[r2][r1 + 2];
                r6 = A[r2][r1 + 3];
                //东北
                r7 = A[r2][r1 + 4];
                r8 = A[r2][r1 + 5];
                r9 = A[r2][r1 + 6];
                r10 = A[r2][r1 + 7];
                /* A Load
        -----------------> 
        ----------------->
        ----------------->
        ----------------->
        . . . .   . . . .
        . . . .   . . . .
        . . . .   . . . .
        . . . .   . . . .                            
        */

                /* B Store
        x         x+4
   1     | | | |   | | | |
   2     | | | |   | | | |
   3     | | | |   | | | |
   4     | | | |   | | | |
        . . . .   . . . .
        . . . .   . . . .
        . . . .   . . . .
        . . . .   . . . .
        */
                //对称轴为西北方向，故 西北 to 西北（就位）
                B[r1][r2] = r3;
                B[r1 + 1][r2] = r4;
                B[r1 + 2][r2] = r5;
                B[r1 + 3][r2] = r6;
                //东北 to 东北（由于上文所说同块间冲突，因此不能放到西南，故先放到东北）
                B[r1 + 3][r2 + 4] = r7;
                B[r1 + 2][r2 + 4] = r8;
                B[r1 + 1][r2 + 4] = r9;
                B[r1][r2 + 4] = r10;
            }

            printMatrix(8, 8, B);
            for (r2 = 0; r2 < 4; r2++)
            {
                //从中间向两侧按列读取
                //西南
                r3 = A[r0 + 4][r1 + r2];
                r4 = A[r0 + 5][r1 + r2];
                r5 = A[r0 + 6][r1 + r2];
                r6 = A[r0 + 7][r1 + r2];
                //东南
                r7 = A[r0 + 4][r1 + 8 - r2];
                r8 = A[r0 + 5][r1 + 8 - r2];
                r9 = A[r0 + 6][r1 + 8 - r2];
                r10 = A[r0 + 7][r1 + 8 - r2];
                /* A Load
         . . . .   . . . .
         . . . .   . . . .
         . . . .   . . . .
         . . . .   . . . .
       4 | | | |   | | | |
       5 | | | |   | | | |
       6 | | | |   | | | |
       7 | | | |   | | | |
        */
                /* B Store
        . . . .   --------
        . . . .   --------
        . . . .   --------
        . . . .   --------
        . . . .   --------
        . . . .   --------
        . . . .   --------
        . . . .   --------                           
        */

                //在B的块内部，先前存在东北角的数据向西南对换，避免了上述所说的纵向冲突。
                //西南 to 东北  东南 to 东南， 均为按行读取，不会发生冲突。
                B[r1 + 7 - r2][r0] = B[r1 + r2][r0 + 4];
                B[r1 + r2][r0 + 4] = r3;
                B[r1 + 7 - r2][r0 + 1] = B[r1 + r2][r0 + 5];
                B[r1 + r2][r0 + 5] = r4;
                B[r1 + 7 - r2][r0 + 2] = B[r1 + r2][r0 + 6];
                B[r1 + r2][r0 + 6] = r5;
                B[r1 + 7 - r2][r0 + 3] = B[r1 + r2][r0 + 7];
                B[r1 + r2][r0 + 7] = r6;
                printMatrix(8, 8, B);


                B[r1 + 8 - r2][r0 + 4] = r7;
                B[r1 + 8 - r2][r0 + 5] = r8;
                B[r1 + 8 - r2][r0 + 6] = r9;
                B[r1 + 8 - r2][r0 + 7] = r10;
            }
        }
    }
    // printMatrix(16, 16, A);
    // printf("\n");
    // printMatrix(16, 16, B);
    return 0;
}